# Pandas basics

Pandas is the [Python data analysis library](https://pandas.pydata.org).

In this notebook we will **learn** how to work with the two main data types in `pandas`: `DataFrame` and `Series`. We will then do an exercise in tidying up a dataset.

## Data structures (`pandas`)

### `Series`

In `pandas`, series are the building blocks of dataframes.

Think of a series as a column in a table. A series collects *observations* about a given *variable*.

In [1]:
from random import random
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

#### Numerical series

In [3]:
# let's create a series containing 100 random numbers
# ranging between 0 and 1

s = pd.Series([random() for n in range(0, 10)]) # we use here a list comprehension

Each observation in the series has an **index** as well as a set of **values**: they can be accessed via the omonymous properties:

In [4]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [5]:
list(s.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
s.values

array([0.74045687, 0.53840591, 0.34534144, 0.75951123, 0.49754071,
       0.64162976, 0.52095993, 0.40780631, 0.87673572, 0.79576601])

The `head()` and `tail()` methods allows for looking at the begininning and end of a series:

In [7]:
s.head()

0    0.740457
1    0.538406
2    0.345341
3    0.759511
4    0.497541
dtype: float64

In [8]:
s.tail()

5    0.641630
6    0.520960
7    0.407806
8    0.876736
9    0.795766
dtype: float64

The `value_counts()` method returns a count of distinct values within a series.

Is there any number in `s` that occurs twice?

In [9]:
# a `Series` can be easily cast into a list

list(s.value_counts()).count(2)

0

Another way of verifying this:

In [10]:
s.is_unique

True

In [11]:
s.min()

0.34534143687017815

In [12]:
s.max()

0.8767357184425081

In [13]:
s.mean()

0.6124153866360333

In [14]:
s.median()

0.5900178313850042

#### Datetime series

In [15]:
from random import randint
from datetime import date

In [33]:
# let's generate a list of random dates

dates = [
    date(
        year,
        randint(1, 12),
        randint(1, 28) 
    )
    for year in range(1930,1950)
]

In [34]:
s1 = pd.Series(dates)

In [35]:
s1

0     1930-05-26
1     1931-06-01
2     1932-07-06
3     1933-02-04
4     1934-03-25
5     1935-01-08
6     1936-09-10
7     1937-07-25
8     1938-10-10
9     1939-05-28
10    1940-03-23
11    1941-06-19
12    1942-07-08
13    1943-03-19
14    1944-11-26
15    1945-01-12
16    1946-12-23
17    1947-02-26
18    1948-12-07
19    1949-08-24
dtype: object

In [36]:
type(s1[1])

datetime.date

In [37]:
s1 = Series(pd.to_datetime(dates))

In [38]:
type(s1[1])

pandas._libs.tslibs.timestamps.Timestamp

In [39]:
s1[1].day_name()

'Monday'

In [40]:
s1.min()

Timestamp('1930-05-26 00:00:00')

In [41]:
s1.max()

Timestamp('1949-08-24 00:00:00')

In [42]:
s1.mean()

Timestamp('1939-12-16 16:48:00')

### `DataFrame`


What is a `pandas.DataFrame`? Think of it as an in-memory spreadsheet that you can analyse and manipulate programmatically.

A `DataFrame` is a collection of `Series` having the same length and whose indexes are in sync. A *collection* means that each column of a dataframe is a series.

Let's create a toy `DataFrame` by hand.

In [43]:
dates = [
    date(
        year,
        randint(1, 12),
        randint(1, 28) # try replacing with 31 and see what happens
    )
    for year in range(1980,1990)
]

In [44]:
counts = [
    randint(0, 10000)
    for i in range(0, 10)
]

In [45]:
event_types = ["fire", "flood", "car_crash", "plane_crash"]
events = [
    np.random.choice(event_types)
    for i in range(0, 10)
]

In [46]:
assert len(events) == len(counts) == len(dates)

In [47]:
toy_df = pd.DataFrame({
    "date": dates,
    "count": counts,
    "event": events
})

In [48]:
toy_df

         date  count        event
0  1980-05-09   3499         fire
1  1981-03-25   9522  plane_crash
2  1982-05-09    535    car_crash
3  1983-05-01   5528    car_crash
4  1984-11-02   6047         fire
5  1985-05-01   4086        flood
6  1986-12-08    273  plane_crash
7  1987-11-08   5319        flood
8  1988-04-26   2635         fire
9  1989-08-20    233    car_crash

**Try out**: what happens if you change the length of either of the two lists? Try e.g. passing 20 dates instead of 10.

In [49]:
# a df is a collection of series
# each column is a series

type(toy_df.date)

pandas.core.series.Series

## Data manipulation in `pandas`

### Data types

String, datetimes (see above), categorical data.

In `pandas`, categories behave very much like string, yet they lead to better performances (faster operations, optimized storage).

Bottom-up approach:

In [50]:
# transforms a Series with strings into categories

toy_df.event.astype('category')

0           fire
1    plane_crash
2      car_crash
3      car_crash
4           fire
5          flood
6    plane_crash
7          flood
8           fire
9      car_crash
Name: event, dtype: category
Categories (4, object): ['car_crash', 'fire', 'flood', 'plane_crash']

### Exploring a dataframe

Exploring a dataframe: df.head(), df.tail(), df.info().

The method `info()` gives you information about a dataframe:
- how much space does it take in memory?
- what is the datatype of each column?
- how many records are there?
- how many `null` values does each column contain (!)?

In [51]:
toy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    10 non-null     object
 1   count   10 non-null     int64
 2   event   10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

Alternatively, if you need to know only the number of columns and rows you can use the `.shape` property.

It returns a tuple with 1) number of rows, 2) number of columns.

In [52]:
toy_df.shape

(10, 3)

`head()` prints by first five rows of a dataframe:

In [53]:
toy_df.head()

         date  count        event
0  1980-05-09   3499         fire
1  1981-03-25   9522  plane_crash
2  1982-05-09    535    car_crash
3  1983-05-01   5528    car_crash
4  1984-11-02   6047         fire

But the number of lines displayed is a parameter that can be changed:

In [54]:
toy_df.head(2)

         date  count        event
0  1980-05-09   3499         fire
1  1981-03-25   9522  plane_crash

`tail()` does the opposite, i.e. prints the last n rows in the dataframe:

In [55]:
toy_df.tail()

         date  count        event
5  1985-05-01   4086        flood
6  1986-12-08    273  plane_crash
7  1987-11-08   5319        flood
8  1988-04-26   2635         fire
9  1989-08-20    233    car_crash

#### Adding columns

Let's go back to our toy dataframe:

In [56]:
toy_df.head()

         date  count        event
0  1980-05-09   3499         fire
1  1981-03-25   9522  plane_crash
2  1982-05-09    535    car_crash
3  1983-05-01   5528    car_crash
4  1984-11-02   6047         fire

Using the column selector with the name of a column that does not exist yet will add the effect of setting the values of all rows in that column to the value specified.

In [57]:
toy_df['country'] = "UK"

In [58]:
toy_df.head(3)

         date  count        event country
0  1980-05-09   3499         fire      UK
1  1981-03-25   9522  plane_crash      UK
2  1982-05-09    535    car_crash      UK

But if the column already exists, its value is reset:

In [59]:
toy_df['country'] = "USA"

In [60]:
toy_df.head(3)

         date  count        event country
0  1980-05-09   3499         fire     USA
1  1981-03-25   9522  plane_crash     USA
2  1982-05-09    535    car_crash     USA

#### Removing columns

The double square bracket notation ``[[...]]`` returns a dataframe having only the columns specified inside the inner brackets.

This said, removing a column is done by unselecting it:

In [61]:
# here we removed the column country 

toy_df2 = toy_df[['date', 'count', 'event']]

In [62]:
# it worked!

toy_df2.head()

         date  count        event
0  1980-05-09   3499         fire
1  1981-03-25   9522  plane_crash
2  1982-05-09    535    car_crash
3  1983-05-01   5528    car_crash
4  1984-11-02   6047         fire

#### Setting a column as index

In [63]:
toy_df.set_index('date')

            count        event country
date
1980-05-09   3499         fire     USA
1981-03-25   9522  plane_crash     USA
1982-05-09    535    car_crash     USA
1983-05-01   5528    car_crash     USA
1984-11-02   6047         fire     USA
1985-05-01   4086        flood     USA
1986-12-08    273  plane_crash     USA
1987-11-08   5319        flood     USA
1988-04-26   2635         fire     USA
1989-08-20    233    car_crash     USA

In [64]:
toy_df.head(3)

         date  count        event country
0  1980-05-09   3499         fire     USA
1  1981-03-25   9522  plane_crash     USA
2  1982-05-09    535    car_crash     USA

In [65]:
toy_df.set_index('date', inplace=True)

In [66]:
toy_df.head(3)

            count        event country
date
1980-05-09   3499         fire     USA
1981-03-25   9522  plane_crash     USA
1982-05-09    535    car_crash     USA

**Q**: can you explain the effect of the `inplace` parameter by looking at the cells above?

### Accessing data

 .loc, .iloc, slicing, iteration over rows

In [67]:
toy_df.head(3)

            count        event country
date
1980-05-09   3499         fire     USA
1981-03-25   9522  plane_crash     USA
1982-05-09    535    car_crash     USA

#### Label-based indexing

In [68]:
toy_df.loc[date(1980,1,1):date(1982,1,1)]

            count        event country
date
1980-05-09   3499         fire     USA
1981-03-25   9522  plane_crash     USA

#### Integer-based indexing

In [69]:
# select a single row, the first one

toy_df.iloc[0]

count      3499
event      fire
country     USA
Name: 1980-05-09, dtype: object

In [70]:
# select  a range of rows by index

toy_df.iloc[[1,3,-1]]

            count        event country
date
1981-03-25   9522  plane_crash     USA
1983-05-01   5528    car_crash     USA
1989-08-20    233    car_crash     USA

In [71]:
# select  a range of rows with slicing

toy_df.iloc[0:5]

            count        event country
date
1980-05-09   3499         fire     USA
1981-03-25   9522  plane_crash     USA
1982-05-09    535    car_crash     USA
1983-05-01   5528    car_crash     USA
1984-11-02   6047         fire     USA

In [72]:
toy_df.index

Index([1980-05-09, 1981-03-25, 1982-05-09, 1983-05-01, 1984-11-02, 1985-05-01,
       1986-12-08, 1987-11-08, 1988-04-26, 1989-08-20],
      dtype='object', name='date')

#### Iterating over rows

In [73]:
for n, row in toy_df.iterrows():
    print(n)

1980-05-09
1981-03-25
1982-05-09
1983-05-01
1984-11-02
1985-05-01
1986-12-08
1987-11-08
1988-04-26
1989-08-20

In [74]:
for n, row in toy_df.iterrows():
    print(n, row.event)

1980-05-09 fire
1981-03-25 plane_crash
1982-05-09 car_crash
1983-05-01 car_crash
1984-11-02 fire
1985-05-01 flood
1986-12-08 plane_crash
1987-11-08 flood
1988-04-26 fire
1989-08-20 car_crash

---